{
    "basics": {
      "name": "Mehul Gupta",
      "label": "The Guy Behind Your Feed",
      "picture": "",
      "email": "mehulg25@gmail.com",
      "phone": "(240) 491-1595",
      "website": "https://mehtalkculous.com",
      "summary": "As an individual who understands both - technology & business, I can help your team leverage the power of data by creating insightful stories that help drive business decisions.",
      "location": {
        "address": "3417 Tulane Drive",
        "postalCode": "MD 20783",
        "city": "Hyattsville",
        "countryCode": "US",
        "region": "Maryland"
      },
      "profiles": [
        {
          "network": "LinkedIn",
          "username": "mehulg25",
          "url": "https://www.linkedin.com/in/mehulg25/"
        },
        {
          "network": "Twitter",
          "username": "mehulg25",
          "url": "https://twitter.com/mehulg25"
        },
        {
            "network": "Github",
            "username": "mehulg25",
            "url": "https://github.com/mehulg25"
          }
      ]
    },
    "education": [
      {
        "institution": "Robert H. Smith School of Business, University of Maryland",
        "area": "Information Systems",
        "studyType": "Master of Science",
        "startDate": "September 2021",
        "endDate": "December 2022",
        "gpa": "3.8",
        "courses": [
          "Big Data and Artificial Intelligence for Business",
          "Database Management Systems",
          "Data Models and Decisions",
          "Data Analysis in Python",
          "Data Mining and Predictive Analytics",
          "Data Visualization and Web Analytics",
          "Applied Finance Information Systems",
          "Project Management",
          "Business Process Analysis for Information Systems",
          "Digital Transformation in Business",
          "Managing Digital Business Markets"
        ]
      },
      {
        "institution": "Manipal University Jaipur",
        "area": "Computers and Communications",
        "studyType": "Bachelors in Technology",
        "startDate": "July 2017",
        "endDate": "May 2021",
        "gpa": "3.2",
        "courses": [
          "Machine Learning",
          "Relational Database and Management Systems",
          "Principles of Web Services",
          "Web Technologies",
          "Principles of Software Engineering",
          "Advanced Data Structures",
          "Programming in C",
          "Operating Systems",
          "Object Oriented Programming using Java",
          "Organization and Management"
        ]
      }
    ],
    "work": [
      {
        "company": "TuneIn",
        "position": "Data Science Intern",
        "website": "https://www.rhsmith.umd.edu",
        "startDate": "June 2022",
        "endDate": "Present",
        "summary": "TuneIn empowers people to hear exactly what they love the moment they want it, and discover a universe of audio, all in one place",
        "highlights": [
          "Built text classifiers using nltk, sentence transformers, and BERT to cluster similar podcasts and extract key topics from transcripts, enhancing discovery of podcasts based on trending topics, reducing drop off in user funnel and improving personalization by 5%",
          "Implemented ML models for strategic placement of mid-roll audio advertisements, increasing revenue from ads by 20%",
          "Collaborated with user research team to generate ad-hoc SQL reports of customer review data, reducing customer churn by 7%"
        ]
      },
      {
        "company": "Startup Shell",
        "position": "Founder's Track",
        "website": "https://startupshell.org",
        "startDate": "March 2022",
        "endDate": "Present",
        "summary": "Founded a startup which focuses on the development of a ticketing platform in the Web3 space",
        "highlights": [
          "Participated in all aspects of business development from market research and finance to operations and marketing, ensuring that the company's vision was followed",
          "Formulated company's vision, goals, and objectives; hired and trained new employees",
          "Built and maintained professional relationships with potential investors and partners; attended various startup and business events",
          "Onboarded India's most talented musicians, allowing them increase their visibility, growth, and royalties"
        ]
      },
      {
        "company": "University of Maryland",
        "position": "Business Strategy Consultant",
        "website": "https://www.rhsmith.umd.edu/centers-initiatives/global-business/programs-initiatives/alumni-industry-professionals/maryland-global-consulting-program",
        "startDate": "May 2022",
        "endDate": "August 2022",
        "summary": "Consulting Fellowship",
        "highlights": [
          "Performed secondary market research and industry analysis for cybersecurity SaaS as a B2C offering in North America",
          "Identified market gap, recommended minimal product offering using competitive benchmarking and devised go-to-market strategy"
        ]
      },
      {
        "company": "Robert H. Smith School of Business, University of Maryland",
        "position": "Graduate Teaching Assistant",
        "website": "https://www.rhsmith.umd.edu",
        "startDate": "January 2022",
        "endDate": "May 2022",
        "summary": "Graduate Teaching Assistant for the course - Essential Data Skills for Business Analytics using Python (BMGT404)",
        "highlights": [
          "Assisted with development and design of the curriculum, supporting research-led and scholarly approach to student learning",
          "Led discussion sessions and tutored data models, python logistic regression techniques, and higher-level statistical modeling"
        ]
      },
      {
        "company": "Humit",
        "position": "Business Analyst",
        "website": "https://www.humit.app",
        "startDate": "May 2021",
        "endDate": "July 2021",
        "summary": "Humit is a social media platform for bite-sized audio sharing and discovery",
        "highlights": [
          "Developed and led implementation of product roadmap while embracing Agile-DevOps",
          "Automated day-to-day processes using bots and web crawlers, enhancing employee productivity by 30%",
          "Analyzed methods to create efficient database schemas through UML diagrams and ERD’s, reduced SQL query time by 20%",
          "Documented requirements, researched growth strategies, identified user pain points, recommended new product features, and analyzed feasibility increasing user satisfaction rate by 80%"
        ]
      },
      {
        "company": "ColoredCow Consulting Pvt. Ltd.",
        "position": "Software Engineer",
        "website": "https://coloredcow.com",
        "startDate": "January 2021",
        "endDate": "April 2021",
        "summary": "ColoredCow is a business consultancy firm",
        "highlights": [
          "Developed web platforms through agile SDLC methods, delivered projects to clients in 50% of the estimated time",
          "Designed database architecture using MySQL to incorporate data of 40,000 users, providing them access to online education",
          "Coordinated with multiple stakeholders and designed go-to-market strategy to increase customer acquisition by 40%"
        ]
      },
      {
        "company": "The Indian Music Diaries",
        "position": "Community Manager",
        "website": "https://theindianmusicdiaries.com",
        "startDate": "July 2020",
        "endDate": "June 2021",
        "summary": "India's first independent music editorial",
        "highlights": [
          "Introduced and launched a Discord Server for TIMD, hosted several series, music sessions on the same and ensured engagement of 1000+ members within a month",
          "Spearheaded Rig Rundown, India's first ever live music podcast of its kind",
          "Organized India's first Independent Music Awards",
          "Maintained liaisons with artists in the Indian Music Industry",
          "Organised workshops on topics revolving around music production, music release, building press-kits, etc.",
          "Curated artists and genre specific playlists under TIMD"
        ]
      },
      {
        "company": "Sofar Sounds",
        "position": "Artist Liaison",
        "website": "https://www.sofarsounds.com",
        "startDate": "January 2020",
        "endDate": "June 2020",
        "summary": "Sofar Sounds, is a music events startup company, responsible for various small performances, hosted in over 400 cities",
        "highlights": [
          "Identified and managed talent for Sofar Sounds",
          "Assisted in curation of various events in Jaipur as a part of their global movement ",
          "Independently undertook organisation of events, logistic handling, hospitality and ensured participation from candidates across the country",
          "Executed online gigs to ensure a consistent event cycle even amidst the lockdown"
        ]
      }
    ],
    "skills": [
      {
        "name": "Tools",
        "level": "Master",
        "keywords": [
          "Jupyter Notebook", 
          "R Studio", 
          "Databricks", 
          "Tableau", 
          "Google Analytics", 
          "MySQL", 
          "SQL Server Management Studio", 
          "AWS (S3, EMR, Redshift)", 
          "PySpark", 
          "Hadoop", 
          "Docker", 
          "MS Office Suite", 
          "Lucid Chart", 
          "Github", 
          "Postman", 
          "Jira", 
          "Confluence", 
          "ProjectLibre"
        ]
      },
      {
        "name": "Programming Languages",
        "level": "Master",
        "keywords": [
          "Python (numpy, pandas, BeautifulSoup, nltk, scikit, keras, TensorFlow, BERTopic, ahocorasick, umap, SentenceTransformer, seaborn, matplotlib, plotly, huggingface)",
          "R (dplyr, ggplot, ggplot2)",
          "Pig",
          "Hive",
          "C",
          "C++",
          "PHP",
          "JavaScript",
          "HTML5",
          "CSS3"
        ]
      },
      {
        "name": "Statistical/ML Techniques",
        "level": "Master",
        "keywords": [
          "Hypothesis Testing", 
          "Confidence Interval", 
          "Linear Regression", 
          "Logistic Regression", 
          "Decision Trees", 
          "Random Forest", 
          "Naïve Bayes Model", 
          "KNN", 
          "K-Means", 
          "Word2Vec", 
          "Transformers", 
          "Bagging and Boosting"
        ]
      }
    ],
    "references": [
      {
        "name": "Akshay Kapoor (Founder - The Indian Music Diaries)",
        "reference": "It is my pleasure to recommend Mehul Gupta. His ability to work independently and sincerely is a trait I have valued while he has worked with us. Mehul has also shown exemplary capacity to identify potential crisis situations and manage them effectively. Mehul was found to be sincere and enterprising with a dedication to get the task completed. In a small amount of time, Mehul became an active contributor to the community development with an ability to work independently and creatively."
      },
      {
        "name": "Prithvi Sankar (Founder - Humit)",
        "reference": "I had the pleasure of working with Mehul during his stint at humit. The fact that he always enjoyed what he did made his work of the highest quality, as he paid attention to all the details in every aspect. He approached every task with great enthusiasm and effort. Mehul knows his way around people, is good with partners, does whatever it takes to help colleagues, and gets things done. Hoping to cross paths again in the future!"
      },
      {
        "name": "Shivakumar Vastrad (Batchmate - University of Maryland)",
        "reference": "I have known Mehul for a little over a year now. I had the pleasure of working with him in various projects and datathons', during our time together at R. H Smith School of Business, University of Maryland, College Park. Mehul is very thorough and meticulous, and the results translate into his work. He is passionate about the tasks that he takes up and is always willing to help his peers. Mehul is committed to consistent learning and sharing his knowledge. He is an asset to any team he works for."
      }
    ]
  }