{
    "basics": {
      "name": "Mehul Gupta",
      "label": "In Data I Trust.",
      "picture": "",
      "email": "mehulg25@gmail.com",
      "phone": "(240) 491-1595",
      "website": "https://mehtalkculous.com",
      "summary": "As a person who understands both the technology and the business, I can help your team leverage the power of data by creating insightful stories that help drive business decisions. ",
      "location": {
        "address": "3417 Tulane Drive",
        "postalCode": "MD 20783",
        "city": "Hyattsville",
        "countryCode": "US",
        "region": "Maryland"
      },
      "profiles": [
        {
          "network": "LinkedIn",
          "username": "mehulg25",
          "url": "https://www.linkedin.com/in/mehulg25/"
        },
        {
          "network": "Twitter",
          "username": "mehulg25",
          "url": "https://twitter.com/mehulg25"
        },
        {
            "network": "Github",
            "username": "mehulg25",
            "url": "https://github.com/mehulg25"
          }
      ]
    },
    "education": [
      {
        "institution": "Robert H. Smith School of Business, University of Maryland",
        "area": "Information Systems",
        "studyType": "Masters",
        "startDate": "September 2021",
        "endDate": "December 2022",
        "gpa": "3.7",
        "courses": [
          "Data Processing and Analysis using Python",
          "Database Management Systems",
          "Data Models and Decisions",
          "Managing Digital Business Markets",
          "Digital Transformation in Business",
          "Project Management"
        ]
      },
      {
        "institution": "Manipal University Jaipur",
        "area": "Computers and Communications",
        "studyType": "Bachelors",
        "startDate": "July 2017",
        "endDate": "May 2021",
        "gpa": "3.2",
        "courses": [
          "Machine Learning",
          "Database Management",
          "Web Services",
          "Java",
          "Organization and Management"
        ]
      }
    ],
    "work": [
      {
        "company": "Robert H. Smith School of Business, University of Maryland",
        "position": "Graduate Teaching Assistant",
        "website": "https://www.rhsmith.umd.edu",
        "startDate": "January 2022",
        "endDate": "Present",
        "summary": "Graduate Teaching Assistant for the course - Essential Data Skills for Business Analytics using Python (BMGT404)",
        "highlights": [
          "Assisted with development and design of the curriculum, supporting research-led and scholarly approach to student learning",
          "Led discussion sessions and tutored data models, python logistic regression techniques, and higher-level statistical modeling"
        ]
      },
      {
        "company": "Humit",
        "position": "Business Analyst Intern",
        "website": "https://www.humit.app",
        "startDate": "May 2021",
        "endDate": "July 2021",
        "summary": "Humit is a social media platform for bite-sized audio sharing and discovery.",
        "highlights": [
          "Developed and led implementation of product roadmap while embracing Agile-DevOps",
          "Consulted on automation of day-to-day manual processes to enhance employee turnaround time by 60%",
          "Analyzed methods to create efficient database schemas through UML diagrams and ERD’s, reduced SQL query time by 20%",
          "Documented requirements, researched growth strategies, identified user pain points, recommended new product features, and analyzed feasibility increasing user satisfaction rate by 80%"
        ]
      },
      {
        "company": "ColoredCow Consulting Pvt. Ltd.",
        "position": "Full Stack Development Intern",
        "website": "https://coloredcow.com",
        "startDate": "January 2021",
        "endDate": "April 2021",
        "summary": "ColoredCow is a business consultancy firm.",
        "highlights": [
          "Developed an online platform using JavaScript (ReactJS), PHP, HTML, and CSS from designed mockups using Agile",
          "Designed database architecture using MySQL to incorporate data of 40000 users, providing them access to online education",
          "Coordinated with multiple stakeholders and documented requirements to increase platform engagement by 40%",
        ]

      },
      {
        "company": "The Indian Music Diaries",
        "position": "Community Manager",
        "website": "https://theindianmusicdiaries.com",
        "startDate": "July 2020",
        "endDate": "June 2021",
        "summary": "Music Editorial",
        "highlights": [
          "Maintained liaisons with artists in the Indian Music Industry",
          "Organised workshops on topics revolving around music production, music release, building press-kits, etc.",
          "Curated artists and genre specific playlists under TIMD",
          "Introduced and launched a Discord Server for TIMD, hosted several series, music sessions on the same and ensured engagement of 1000+ members within a month"
        ]
      },
      {
        "company": "Sofar Sounds",
        "position": "Artist Liaison",
        "website": "https://www.sofarsounds.com",
        "startDate": "January 2020",
        "endDate": "June 2020",
        "summary": "Event Management",
        "highlights": [
          "Identified and managed talent for Sofar Sounds",
          "Assisted in curation of various events in Jaipur as a part of their global movement ",
          "Independently undertook organisation of events, logistic handling, hospitality and ensured participation from candidates across the country",
          "Executed online gigs to ensure a consistent event cycle even amidst the lockdown"
        ]
      }
    ],
    "skills": [
      {
        "name": "Tools",
        "level": "Master",
        "keywords": [
          "Jupyter Notebook", 
          "Google Analytics",
          "Tableau", 
          "Anaconda",
          "MS Office Suite", 
          "MySQL", 
          "SQL Server Management Studio",
          "Lucid Chart", 
          "Snowflake", 
          "Salesforce", 
          "AWS", 
          "GitHub", 
          "Kaggle", 
          "Postman", 
          "Jira"
        ]
      },
      {
        "name": "Programming Languages",
        "level": "Master",
        "keywords": [
          "Python (numpy, pandas, BeautifulSoup, nltk, scikit, seaborn, matplotlib, plotly, TensorFlow)",
          "R",
          "HTML5",
          "CSS3"
        ]
      }
    ],
    "references": [
      {
        "name": "Akshay Kapoor (Founder - The Indian Music Diaries)",
        "reference": "It is my pleasure to recommend Mehul Gupta. His ability to work independently and sincerely is a trait I have valued while he has worked with us. Mehul has also shown exemplary capacity to identify potential crisis situations and manage them effectively. Mehul was found to be sincere and enterprising with a dedication to get the task completed. In a small amount of time, Mehul became an active contributor to the community development with an ability to work independently and creatively."
      },
      {
        "name": "Prithvi Sankar (Founder - Humit)",
        "reference": "I had the pleasure of working with Mehul during his stint at humit. The fact that he always enjoyed what he did made his work of the highest quality, as he paid attention to all the details in every aspect. He approached every task with great enthusiasm and effort. Mehul knows his way around people, is good with partners, does whatever it takes to help colleagues, and gets things done. Hoping to cross paths again in the future!"
      }
    ]
  }